In [2]:
import operaciones
import pandas as pd

In [3]:
df=pd.DataFrame( {"col1": [2,3,5,6]}) #construyo un df de una columna
df

   col1
0     2
1     3
2     5
3     6

In [6]:
operaciones.estandarizar(df,"col1")

   col1
0  0.00
1  0.25
2  0.75
3  1.00

In [ ]:
#Ejercicio 5 combinando notebook y...

In [10]:
import limpieza
import pandas as pd

In [11]:
df = pd.DataFrame([('Foreign Cinema', 'Restaurant', 289.0),
                   ('Liho Liho', 'Restaurant', 224.0),
                   ('500 Club', 'bar', 80.5),
                   ('The Square', 'bar', 25.30)],
           columns=('name', 'type', 'AvgBill')
                 )
df

             name        type  AvgBill
0  Foreign Cinema  Restaurant    289.0
1       Liho Liho  Restaurant    224.0
2        500 Club         bar     80.5
3      The Square         bar     25.3

In [15]:
limpieza.reemplazar_por_media(df,'AvgBill')

             name        type  AvgBill
0  Foreign Cinema  Restaurant    154.7
1       Liho Liho  Restaurant    154.7
2        500 Club         bar    154.7
3      The Square         bar    154.7

#EL EJERCICIO 2 2) En ``transformaciones.py` NO ENTENDI QUE DIJO

In [19]:
import pandas as pd
import numpy as np

df= pd.read_csv("Miquel.csv.txt") #porque no me abre con la configuracion de miquel????????????????????
print(df)

   Nombre Apellidos  Altura Sexo  Nacimiento   Cof Categoria
0    Will     Smith    1.43    M  10/10/1920  0.19   laboral
1     Jon      Snow    1.98    M   10/1/1970  0.98   laboral
2    Laia   Ramirez    1.87    F  09/10/1987  0.76      cap6
3    Luzy      Raim    1.67    F  23/07/1979  0.56      cap6
4    Fein      Mang    1.78    M  12/03/1937  0.27      cap6
5  Victor     Colom    1.78    M  22/09/1957  0.97      cap8

In [18]:
bySex = df.groupby('Sexo')
bySex

In [20]:
bySex.group

AttributeError: 'DataFrameGroupBy' object has no attribute 'group'

In [21]:
dfM = df.loc[bySex.groups['M'].values] #Recorda que "loc" accedeix per index de fila
dfM

   Nombre Apellidos  Altura Sexo  Nacimiento   Cof Categoria
0    Will     Smith    1.43    M  10/10/1920  0.19   laboral
1     Jon      Snow    1.98    M   10/1/1970  0.98   laboral
4    Fein      Mang    1.78    M  12/03/1937  0.27      cap6
5  Victor     Colom    1.78    M  22/09/1957  0.97      cap8

In [22]:
df[df.Sexo=="M"] # es lo  mismo!

   Nombre Apellidos  Altura Sexo  Nacimiento   Cof Categoria
0    Will     Smith    1.43    M  10/10/1920  0.19   laboral
1     Jon      Snow    1.98    M   10/1/1970  0.98   laboral
4    Fein      Mang    1.78    M  12/03/1937  0.27      cap6
5  Victor     Colom    1.78    M  22/09/1957  0.97      cap8

In [28]:
dfg = df.groupby(["Categoria"]).aggregate({
    "Altura":"max",
    "Cof":"mean"})

dfg

           Altura    Cof
Categoria
cap6         1.87  0.530
cap8         1.78  0.970
laboral      1.98  0.585

In [29]:
dfg = df.groupby(["Categoria"]).aggregate({
    "Altura":"sum",
    "Cof":"mean"})

dfg

           Altura    Cof
Categoria
cap6         5.32  0.530
cap8         1.78  0.970
laboral      3.41  0.585

In [24]:
dfg.index

Index(['cap6', 'cap8', 'laboral'], dtype='object', name='Categoria')

In [26]:
type(dfg) #Alerta! Una agregación genera un dataframe y por lo tanto podemos seguir aplicando lo que ya sabemos

pandas.core.frame.DataFrame

In [30]:
dfg[dfg.Altura>3]

           Altura    Cof
Categoria
cap6         5.32  0.530
laboral      3.41  0.585

In [31]:
gr = df.groupby(['Sexo',"Categoria"]).mean(numeric_only=True)
gr

                Altura    Cof
Sexo Categoria
F    cap6        1.770  0.660
M    cap6        1.780  0.270
     cap8        1.780  0.970
     laboral     1.705  0.585

In [32]:
gr = df.groupby(['Sexo',"Categoria"])["Sexo"].count()
print(gr)

Sexo  Categoria
F     cap6         2
M     cap6         1
      cap8         1
      laboral      2
Name: Sexo, dtype: int64

In [33]:
gr = df.groupby(['Sexo',"Categoria"]).count()
gr.index

MultiIndex([('F',    'cap6'),
            ('M',    'cap6'),
            ('M',    'cap8'),
            ('M', 'laboral')],
           names=['Sexo', 'Categoria'])

In [34]:
gr.loc[("M",:)] # Como accedemos en rango en un multiindice?

SyntaxError: invalid syntax (209455939.py, line 1)

In [35]:
gr.loc["F"] # primer index

           Nombre  Apellidos  Altura  Nacimiento  Cof
Categoria
cap6            2          2       2           2    2

In [36]:
#Agregaciones avanzadas VER DE DONDE SALE LA BASE DE DATOS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

In [38]:
import pandas as pd
import numpy as np

df= pd.read_csv("WHO.csv")
print(df)

                Country  CountryID  Continent  Adolescent fertility rate (%)  \
0           Afghanistan          1          1                          151.0
1               Albania          2          2                           27.0
2               Algeria          3          3                            6.0
3               Andorra          4          2                            NaN
4                Angola          5          3                          146.0
..                  ...        ...        ...                            ...
197             Vietnam        198          6                           25.0
198  West Bank and Gaza        199          1                            NaN
199               Yemen        200          1                           83.0
200              Zambia        201          3                          161.0
201            Zimbabwe        202          3                          101.0

     Adult literacy rate (%)  \
0                       28.0
1                       98.7
2                       69.9
3                        NaN
4                       67.4
..                       ...
197                     90.3
198                      NaN
199                     54.1
200                     68.0
201                     89.5

     Gross national income per capita (PPP international $)  \
0                                                  NaN
1                                               6000.0
2                                               5940.0
3                                                  NaN
4                                               3890.0
..                                                 ...
197                                             2310.0
198                                                NaN
199                                             2090.0
200                                             1140.0
201                                                NaN

     Net primary school enrolment ratio female (%)  \
0                                              NaN
1                                             93.0
2                                             94.0
3                                             83.0
4                                             49.0
..                                             ...
197                                           91.0
198                                            NaN
199                                           65.0
200                                           94.0
201                                           88.0

     Net primary school enrolment ratio male (%)  \
0                                            NaN
1                                           94.0
2                                           96.0
3                                           83.0
4                                           51.0
..                                           ...
197                                         96.0
198                                          NaN
199                                         85.0
200                                         90.0
201                                         87.0

     Population (in thousands) total  Population annual growth rate (%)  ...  \
0                            26088.0                                4.0  ...
1                             3172.0                                0.6  ...
2                            33351.0                                1.5  ...
3                               74.0                                1.0  ...
4                            16557.0                                2.8  ...
..                               ...                                ...  ...
197                          86206.0                                1.4  ...
198                              NaN                                NaN  ...
199                          21732.0                                3.0  ...
200                          11696.0                                1.9  ...
201                          13228.0                                0.8  ...

     Total_CO2_emissions  Total_income  Total_reserves  \
0                 692.50           NaN             NaN
1                3499.12  4.790000e+09           78.14
2              137535.56  6.970000e+10          351.36
3                    NaN           NaN             NaN
4                8991.46  1.490000e+10           27.13
..                   ...           ...             ...
197            101826.23  4.480000e+10           47.11
198               655.86  3.780000e+09             NaN
199             20148.34  1.150000e+10          114.52
200              2366.94  4.090000e+09           10.41
201             11457.33  5.620000e+09            3.39

     Trade_balance_goods_and_services  Under_five_mortality_from_CME  \
0                                 NaN                         257.00
1                       -2.040000e+09                          18.47
2                        4.700000e+09                          40.00
3                                 NaN                            NaN
4                        9.140000e+09                         164.10
..                                ...                            ...
197                     -1.940000e+09                          20.20
198                               NaN                          28.00
199                      8.310000e+08                          82.40
200                     -4.470000e+08                         175.30
201                     -1.710000e+08                         106.50

     Under_five_mortality_from_IHME  Under_five_mortality_rate  \
0                             231.9                     257.00
1                              15.5                      18.47
2                              31.2                      40.00
3                               NaN                        NaN
4                             242.5                     164.10
..                              ...                        ...
197                            23.4                      20.20
198                            25.8                      28.00
199                            87.9                      82.40
200                           163.8                     175.30
201                            67.0                     106.50

     Urban_population  Urban_population_growth  Urban_population_pct_of_total
0           5740436.0                     5.44                           22.9
1           1431793.9                     2.21                           45.4
2          20800000.0                     2.61                           63.3
3                 NaN                      NaN                            NaN
4           8578749.0                     4.14                           53.3
..                ...                      ...                            ...
197        21900000.0                     2.90                           26.4
198         2596216.0                     3.33                           71.6
199         5759120.5                     4.37                           27.3
200         4017411.0                     1.95                           35.0
201         4709965.0                     1.90                           35.9

[202 rows x 358 columns]

In [ ]:
#Ejercicio  volumen total de CO2 emitido por cada continente?

In [41]:
codigoContinentes = {1:"A",2:"B",3:"C", 4:"D", 5:"E", 6:"F", 7:"G"}

In [47]:
dfg = df.groupby(["Continent"]).aggregate({
    "Total_CO2_emissions":"sum"})

dfg

           Total_CO2_emissions
Continent
1                   1712275.15
2                   6574395.81
3                    801412.05
4                   6739887.62
5                    975690.21
6                   3651036.81
7                   7140179.57

In [ ]:
#2) ¿Cuál es el número de paises por continente?

In [50]:
dfg1 = df.groupby(["Continent"]).aggregate({
    "Country":"count"})

dfg1

           Country
Continent
1               21
2               51
3               48
4                7
5               31
6               35
7                9

In [51]:
#3) Del conjunto “who.csv” selecciona 30 paises al azar y sobre ellos calcula la media de “Net primary school enrolment ratio female (%)” agrupados por: Continente

In [61]:
df.sample(30)
dfg2 = df.groupby(["Country"]).aggregate({
    "Net primary school enrolment ratio female (%)":"mean"})

dfg2 #creo que aca no logro que solo sean 30

                    Net primary school enrolment ratio female (%)
Country
Afghanistan                                                   NaN
Albania                                                      93.0
Algeria                                                      94.0
Andorra                                                      83.0
Angola                                                       49.0
...                                                           ...
Vietnam                                                      91.0
West Bank and Gaza                                            NaN
Yemen                                                        65.0
Zambia                                                       94.0
Zimbabwe                                                     88.0

[202 rows x 1 columns]

In [ ]:
#3b) Repite la anterior actividad pero ahora con todos los paises. ¿Sale la misma media?

In [62]:
dfg3 = df.groupby(["Country"]).aggregate({
    "Net primary school enrolment ratio female (%)":"mean"})

dfg3

                    Net primary school enrolment ratio female (%)
Country
Afghanistan                                                   NaN
Albania                                                      93.0
Algeria                                                      94.0
Andorra                                                      83.0
Angola                                                       49.0
...                                                           ...
Vietnam                                                      91.0
West Bank and Gaza                                            NaN
Yemen                                                        65.0
Zambia                                                       94.0
Zimbabwe                                                     88.0

[202 rows x 1 columns]

In [63]:
import numpy as np
import pandas as pd
np.random.seed(0)
df_random = pd.DataFrame({"candidat":np.arange(1,11), "nota":np.random.randint(0,11,size=10)})
df_random

   candidat  nota
0         1     5
1         2     0
2         3     3
3         4     3
4         5     7
5         6     9
6         7     3
7         8     5
8         9     2
9        10     4

In [64]:
df_random["notaCategorica"] = pd.cut(df_random.nota, 3, labels=["dolent", "mig", "bona"])
df_random # 3 categorias de malo medio y bueno

   candidat  nota notaCategorica
0         1     5            mig
1         2     0         dolent
2         3     3         dolent
3         4     3         dolent
4         5     7           bona
5         6     9           bona
6         7     3         dolent
7         8     5            mig
8         9     2         dolent
9        10     4            mig

In [68]:
df_random.notaCategorica

0            Be
1       Suspens
2       Suspens
3       Suspens
4            Be
5    Excel·lent
6       Suspens
7            Be
8       Suspens
9       Suspens
Name: notaCategorica, dtype: category
Categories (4, object): ['Suspens' < 'Be' < 'Notable' < 'Excel·lent']

In [65]:
df_random[df_random.notaCategorica==df_random.notaCategorica.max()]

   candidat  nota notaCategorica
4         5     7           bona
5         6     9           bona

In [66]:
# mejora
bins = [-1, 4, 7, 8.5, 10]
labels = ['Suspens', 'Be', 'Notable', 'Excel·lent'] #como califica lo de arriba
df_random["notaCategorica"] = pd.cut(df_random.nota, bins, labels=labels) # include_lowest=True
df_random

   candidat  nota notaCategorica
0         1     5             Be
1         2     0        Suspens
2         3     3        Suspens
3         4     3        Suspens
4         5     7             Be
5         6     9     Excel·lent
6         7     3        Suspens
7         8     5             Be
8         9     2        Suspens
9        10     4        Suspens

In [69]:
# Podemos definir el intervalo que deseemos (como un Histograma)
import numpy as np
marks = np.arange(0,1.1,0.25)
print(marks)
print
print("-"*10)
factors = pd.qcut(df_random.nota, marks)
print(factors)
print("-"*10)
print(pd.value_counts(factors))
print(df_random.nota)

[0.   0.25 0.5  0.75 1.  ]
----------
0       (3.5, 5.0]
1    (-0.001, 3.0]
2    (-0.001, 3.0]
3    (-0.001, 3.0]
4       (5.0, 9.0]
5       (5.0, 9.0]
6    (-0.001, 3.0]
7       (3.5, 5.0]
8    (-0.001, 3.0]
9       (3.5, 5.0]
Name: nota, dtype: category
Categories (4, interval[float64, right]): [(-0.001, 3.0] < (3.0, 3.5] < (3.5, 5.0] < (5.0, 9.0]]
----------
nota
(-0.001, 3.0]    5
(3.5, 5.0]       3
(5.0, 9.0]       2
(3.0, 3.5]       0
Name: count, dtype: int64
0    5
1    0
2    3
3    3
4    7
5    9
6    3
7    5
8    2
9    4
Name: nota, dtype: int32

C:\Users\Nico\AppData\Local\Temp\ipykernel_5272\316324575.py:10: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  print(pd.value_counts(factors))